[

    {
        "id": 1,
        "thumb": "/images/others/process-1.png",
        "subtitle": "Step One",
        "title": "Creative Brief",
        "paragraph": "An effective corporate logo is the foundation of any successful corporate identity. At Origin Softwares, we specialize in creating logos that perfectly represent our client's needs and objectives. We believe that a well-designed logo can positively impact potential customers and give your company a competitive edge. Our team takes the time to understand your business and design a business logo that communicates your mission and vision clearly and memorably."
    },
    {
        "id": 2,
        "thumb": "/images/others/process-2.png",
        "subtitle": "Step Two",
        "title": "Doing the Research",
        "paragraph": "As the best logo designing services provider in India, we firmly believe that research and action go hand-in-hand; neither can exist without the other. In this initial stage, we investigate your business and its industry inside and out. It allows us to understand what your competitors are up to and what strategies they use to engage potential customers. By understanding the latest trends in your industry, we can position your logo design ahead of the curve while maintaining a timeless look and feel."
    },
    {
        "id": 3,
        "thumb": "/images/others/process-3.png",
        "subtitle": "Step Three",
        "title": "Conceptual phase",
        "paragraph": "At our company, we pride ourselves on our creative designers. We believe they are some of the most talented in the industry and have a keen eye for detail in finding the right graphic style and image to represent your business. As the best logo design company in India, we offer a unique identity to your business based on aspects like aesthetic looks and the best user experience."
    },
    {
        "id": 4,
        "thumb": "/images/others/process-4.png",
        "subtitle": "Step four",
        "title": "Fill it with brand Colors",
        "paragraph": "We understand that coming up with a logo for your business can be a daunting task. But our team of professional and inventive logo designers is here to help! We'll work with you to develop a logo that not only represents your business well but also catches the eye of your target audience. We're proud to offer customized designing services that consider your ideas and inspiration to create a professional and memorable logo. Once our LOGO designer is satisfied with the sketch, they will move forward to fill in the colors and make it look more natural by trying various color combinations."
    }
]